In [1]:
import numpy as np
import pandas as pd
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a','b','c','d', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to change the score in row 'd' to 11.5

In [2]:
df.loc['d','score'] = 11.5
df.loc['d']

name        James
score        11.5
attempts        3
qualify        no
Name: d, dtype: object

Write a Pandas program to calculate the sum of the examination attempts by the students

In [3]:
sum_attempts = df['attempts'].sum()
print("sum of examination :",sum_attempts)

sum of examination : 19

Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [4]:
mean_score = df['score'].mean()
print("mean score student :",mean_score)

mean score student : 13.333333333333334

Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame

In [5]:
df.loc['k'] = ['Rika',99,5,'yes']
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k       Rika   99.0         5     yes

Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [6]:
print(df.sort_values(by=['name','score'],ascending=[True,False]))
print()
print(df.sort_values(by=['name','score'],ascending=[False,True]))

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James   11.5         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes
k       Rika   99.0         5     yes

        name  score  attempts qualify
k       Rika   99.0         5     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [7]:
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k       Rika   99.0         5     True

write a Pandas program to change the name 'James' to 'Suresh' in name column of the data frame.

In [8]:
df['name'].replace('James', 'Suresh')

a    Anastasia
b         Dima
c    Katherine
d       Suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
k         Rika
Name: name, dtype: object

Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [9]:
df.pop('attempts')
df

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James   11.5    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True
k       Rika   99.0     True

Write a Pandas program to insert a new column in existing DataFrame.

color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']

In [0]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red','Red']
df['color'] = color

Write a Pandas program to iterate over rows in a DataFrame

In [11]:
for index, row in df.iterrows():
  print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James 11.5
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0
Rika 99.0

Write a Pandas program to get list from DataFrame column headers

In [12]:
df_header = list(df.columns.values)
print(df_header)

['name', 'score', 'qualify', 'color']

Write a Pandas program to rename columns of a given DataFrame

In [13]:
df = df.rename(columns={'name': 'Columns1', 'score' : 'Columns2', 'qualify' : 'Columns3', 'color' : 'Columns4'})
df

    Columns1  Columns2  Columns3 Columns4
a  Anastasia      12.5      True      Red
b       Dima       9.0     False     Blue
c  Katherine      16.5      True   Orange
d      James      11.5     False      Red
e      Emily       9.0     False    White
f    Michael      20.0      True    White
g    Matthew      14.5      True     Blue
h      Laura       NaN     False    Green
i      Kevin       8.0     False    Green
j      Jonas      19.0      True      Red
k       Rika      99.0      True      Red

Write a Pandas program to select rows from a given DataFrame based on values in some column

In [14]:
df.loc[df['Columns2'] > 20]

  Columns1  Columns2  Columns3 Columns4
k     Rika      99.0      True      Red

Write a Pandas program to change the order of a DataFrame columns

In [15]:
df =df[['Columns3','Columns1','Columns2','Columns4']]
df

   Columns3   Columns1  Columns2 Columns4
a      True  Anastasia      12.5      Red
b     False       Dima       9.0     Blue
c      True  Katherine      16.5   Orange
d     False      James      11.5      Red
e     False      Emily       9.0    White
f      True    Michael      20.0    White
g      True    Matthew      14.5     Blue
h     False      Laura       NaN    Green
i     False      Kevin       8.0    Green
j      True      Jonas      19.0      Red
k      True       Rika      99.0      Red

Write a Pandas program to add one row in an existing DataFrame

In [16]:
df =df[['Columns1','Columns2','Columns3','Columns4']]
df

    Columns1  Columns2  Columns3 Columns4
a  Anastasia      12.5      True      Red
b       Dima       9.0     False     Blue
c  Katherine      16.5      True   Orange
d      James      11.5     False      Red
e      Emily       9.0     False    White
f    Michael      20.0      True    White
g    Matthew      14.5      True     Blue
h      Laura       NaN     False    Green
i      Kevin       8.0     False    Green
j      Jonas      19.0      True      Red
k       Rika      99.0      True      Red